<!DOCTYPE html>
<html>
<head>
<title>HTML Keyla Casta&ntilde;o-Inicio</title>
<link rel="stylesheet" href="CSS/style.css">
</head>

<body>

<ul class="navbar">
<li>Datos b&aacute;sicos</a>
<li><a href="tipos.html">Tipos de Hardware y Software</a>
<li><a href="componentes.html">Componentes</a>
<li><a href="test.html">Test</a>
</ul>

<center><h1>DEFINICI&Oacute;N DE HARDWARE Y SOFTWARE</h1>
<IMG SRC="IMG/harsof.png " alt="Hardware y Software" style="width:400px;height:250px;"></center>
<p>El hardware y el software son dos elementos fundamentales en el funcionamiento de cualquier computadora. <b>El hardware se refiere al conjunto de componentes f&iacute;sicos, mec&aacute;nicos, el&eacute;ctricos o electr&oacute;nicos que conforman un computador.</b> Estos componentes son tangibles y se pueden tocar y ver. Algunos ejemplos de hardware son los monitores o proyectores, el teclado y rat&oacute;n, las webcams, los microprocesadores y las tarjetas de red.<br><br>
Por otro lado, <b>el software se refiere al conjunto de programas, aplicaciones, instrucciones y protocolos de comunicaci&oacute;n que se ejecutan en el hardware.</b> A diferencia del hardware, el software no es tangible, es decir, no se puede tocar ni ver f&iacute;sicamente. Algunos ejemplos de software son Microsoft Windows, Mozilla Firefox, Microsoft Word, Google Chrome y Adobe Photoshop.<br><br>
Tanto <b>el hardware como el software son indispensables para el funcionamiento de una computadora.</b> El hardware proporciona la estructura f&iacute;sica y los componentes necesarios para llevar a cabo las tareas, mientras que el software permite que estos componentes funcionen correctamente y realicen las acciones deseadas. Ambos trabajan en conjunto para permitir <b>el uso y disfrute de una amplia variedad de aplicaciones y programas,</b> desde juegos y redes sociales hasta herramientas de productividad y dise&ntilde;o gr&aacute;fico.<br><br>
En efecto, <b>el hardware y el software son elementos complementarios y fundamentales</b> en el funcionamiento de una computadora. El hardware se refiere al conjunto de componentes f&iacute;sicos, mientras que <b>el software se refiere al conjunto de programas y aplicaciones virtuales.</b> Ambos son necesarios para que una computadora funcione correctamente y pueda ejecutar las tareas deseadas. Sin hardware, no habr&oacute;a estructura f&oacute;sica para el software, y sin software, el hardware no podr&oacute;a realizar las acciones necesarias para el uso y disfrute de las aplicaciones y programas.</p>

<h2><p>&iquest;Qu&eacute es el hardware y cu&aacute;les son sus componentes&#63</p></h2>
<center><IMG SRC="IMG/hardware1.jpg" alt="Hardware" style="width:287px;height:207px;"></center>
<p>El hardware se refiere a <b>las partes f&iacute;sicas y tangibles de un sistema inform&aacute;tico.</b> Estas partes incluyen componentes el&eacute;ctricos, electr&oacute;nicos y electromec&aacute;nicos. En otras palabras, el hardware es todo aquello que podemos ver y tocar en nuestro ordenador. Los cables, muebles o cajas, perif&eacute;ricos y cualquier otro elemento f&iacute;sico involucrado componen el hardware.</p>

<h3><p class="dotted"> Componentes del Hardware</p></h3>

<ul>
<li><b>Unidad Central de Procesamiento (CPU):</b> Es el cerebro de la computadora. Se encarga de ejecutar las instrucciones y realizar los c&aacute;lculos necesarios para que el sistema funcione. </li>
<li><b>Memoria R&aacute;pida de Trabajo: </b> Es donde se almacenan temporalmente los datos y las instrucciones que la CPU necesita para operar de manera eficiente. </li>
<li><b>Unidad de Almacenamiento Fija: </b> Sirve para guardar permanentemente la informaci&oacute;n en el sistema, como el disco duro o las unidades de estado s&oacute;lido (SSD). </li>
<li><b>Perif&eacute;ricos de Entrada: </b> Son dispositivos que permiten al usuario introducir informaci&oacute;n en la computadora, como el teclado y el mouse. </li>
<li><b>Perif&eacute;ricos de Salida: </b> Son dispositivos que permiten al usuario recibir informaci&oacute;n de la computadora, como el monitor y la impresora.</li>
</ul>

<h2><p>&iquest;Qu&eacute es el Software y cu&aacute;les son sus tipos&#63</p></h2>
<center><IMG SRC="IMG/software1.jpg" alt="Software" style="width:299px;height:168px;"></center>
<p>El software es un conjunto de programas y aplicaciones necesarios para ejecutar los procesos de un sistema inform&aacute;tico. Es la parte intangible de un ordenador que permite el funcionamiento de las diferentes tareas y operaciones. Sin software, el hardware no ser&iacute;a capaz de realizar ninguna funci&oacute;n.
Existen diferentes <b>tipos de software,</b> los cuales se pueden clasificar en tres grandes grupos: <b>software de aplicaci&oacute;n, software de programaci&oacute;n y software de sistema. </b>
<li>El <b>software de aplicaci&oacute;n</b> incluye herramientas como bases de c&aacute;lculo, programas de empresa o de dise&ntilde;o. Este tipo de software abarca desde aplicaciones de ofim&aacute;tica y editores de texto hasta programas espec&iacute;ficos para diferentes sectores, como el software para hoteles. </li>
<li>El <b>software de programaci&oacute;n</b> es fundamental para el desarrollo de aplicaciones inform&aacute;ticas. Ejemplos de este tipo de software son los editores de texto y los compiladores. </li>
<li>El <b>software de sistema</b> es indispensable para el funcionamiento adecuado del hardware. Incluye componentes como los drivers y los sistemas operativos, como Windows o Mac. </li><br>
En cuanto a los <b>tipos de software por licencia, </b> se pueden encontrar dos categor&iacute;as principales: <b>software libre y software de propietario. </b> El software libre no tiene copyright y se puede usar y distribuir libremente, mientras que el software de propietario est&aacute; limitado legalmente en su uso, distribuci&oacute;n y copia.
En cuanto al <b>tipo de alojamiento del software, </b> se pueden considerar dos opciones: <b>on premise y en la nube. </b> El software on premise se instala y utiliza dentro de la empresa, lo que implica la responsabilidad de mantenerlo en un servidor interno. Por otro lado, el software en la nube permite trabajar con la informaci&oacute;n de forma remota, en un repositorio externo a la empresa.
De manera que, el software es un conjunto de programas y aplicaciones necesarios para el funcionamiento de un sistema inform&aacute;tico. Se puede clasificar en diferentes tipos seg&uacute;n su funcionalidad, licencia y tipo de alojamiento.</p>







<!-- Firma y fecha de la página, ¡sólo por cortesía! -->
<address>Creada por Keyla Johana Casta&ntilde;o<br>
Gesis<br>
Universidad de Antioquia.</address>
<footer>
<p>Programa SISTEMAS DE INFORMACI&OacuteN<br>
DOCENTE: Carlos Tangarife </p>
</footer>

</body>
</html>