<!DOCTYPE html>
<html lang="es">
<head>
<title>HTML Keyla Casta&ntilde;o-Tipos Hardware y Software</title>
<link rel="stylesheet" href="CSS/style.css">
</head>
<body>
<!-- Menú de navegación del sitio -->
<ul class="navbar">
<li><a href="inicio.html">Datos b&aacute;sicos</a>
<li>Tipos de Hardware y Software</a>
<li><a href="componentes.html">Componentes</a>
<li><a href="test.html">Test</a>
</ul>

<h1>TIPOS DE HARDWARE Y SOFTWARE</h1>
<hr>
<h2>Tipos de Hardware:</h2>
<ul>
<li><b>Hardware de procesamiento.</b> El coraz&oacute;n del sistema, digita, calcula y resuelve las operaciones necesarias para su funcionamiento. </li>
<li><b>Hardware de almacenamiento.</b> Sirve para contener la informaci&oacute;n y los datos del sistema. Puede ser primario (interno) o secundario (extra&iacute;ble). </li>
<li><b>Hardware perif&eacute;rico. </b>  Es el conjunto de aditamentos y accesorios que pueden incorporarse al sistema para brindarle nuevas funciones. </li>
<li><b>Hardware de entrada. </b>  Permite introducir datos al sistema por el usuario u operador, o proveniente de redes y sistemas de telecomunicaciones. </li>
<li><b>Hardware de salida. </b>  Permite extraer informaci&oacute;n del sistema o enviarlo a redes de telecomunicaciones. </li>
<li><b>Hardware mixto. </b>  Cumple las funciones de entrada y salida a la vez.</li>
</ul>

<H3><P class="dashed">Ejemplos:</P></h3>
<ol>
<li><b>Monitores o pantallas. </b> En los que la informaci&oacute;n y los procesos son exhibidos para el usuario. Suelen considerarse hardware de salida, si bien existen monitores t&aacute;ctiles que permiten el ingreso de datos tambi&eacute;n (mixtos). </li>
<li><b>Teclado y rat&oacute;n. </b> Los cl&aacute;sicos mecanismos de entrada o incorporaci&oacute;n de datos por parte del usuario, el primero a trav&eacute;s de botones (teclas) y el segundo a trav&eacute;s de movimientos principalmente. </li>
<li><b>C&aacute;maras de video. </b>  Tambi&eacute;n llamadas webcams, ya que se popularizaron con la llegada de Internet y las videoconferencias, son un mecanismo t&iacute;pico de entrada de imagen y audio. </li>
<li><b>Procesador. </b> El n&uacute;cleo de la CPU (Central Processing Unit), es un chip capaz de realizar millares de calculaciones por segundo y que brinda el poder central de procesamiento de informaci&oacute;n al sistema computacional. </li>
<li><b>Tarjeta de red. </b>  Un conjunto de circuitos electr&oacute;nicos integrados a la placa base del CPU y que le brindan al computador la posibilidad de interactuar con distintas redes de datos a distancia. </li>
<li>ETC...
</ol>

<h2>El software puede clasificarse de acuerdo a su función principal en:</h2>
<ul>
<li><b>Software de sistema o b&aacute;sico</b> (sistema operativo). Son los encargados de regular el funcionamiento del sistema y garantizar su manutenci&oacute;n. Suelen estar incorporados al sistema antes de que el usuario acceda a &eacute;l. Por ejemplo: Windows 10, Linux, Ubuntu.</li>
<li><b>Software de aplicaci&oacute;n.</b> Todos aquellos programas adicionales que pueden incorporarse al computador una vez instalado el sistema operativo y que permiten llevar a cabo un sinf&iacute;n de tareas posibles, desde procesadores de texto hasta navegadores de internet o herramientas de diseño o videojuegos. Por ejemplo: Chrome, Paint, Skype.</li>
</ul>

<H3><P class="dashed">Ejemplos:</P></h3>
<ol>
<li><b>Microsoft Windows. </b> Quiz&aacute; el m&aacute;s popular sistema operativo del mundo, empleado en millares de computadores IBM y que permite el manejo y la interacci&oacute;n de los distintos segmentos de computador a partir de un entorno de usuario amigable, basado en ventanas que se superponen con la informaci&oacute;n. </li>
<li><b>Mozilla Firefox. </b> Uno de los m&aacute;s populares navegadores de Internet, disponible para descarga gratuita. Permite la interacci&oacute;n del usuario con la World Wide Web, as&iacute; como realizar b&uacute;squedas de datos y otro tipo de interacciones vituales. </li>
<li><b>Microsoft Word. </b> Probablemente el m&aacute;s popular procesador de texto del mundo, parte del paquete de Microsoft Office, que incluye herramientas para negocios, gesti&oacute;n de bases de datos, elaboraci&oacute;n de presentaciones, etc. </li>
<li><b>Google Chrome. </b> El navegador de Google, impuso un paradigma de ligereza y velocidad en el campo de los exploradores de Internet y se hizo r&aacute;pidamente popular entre los adeptos a la Internet. Su &eacute;xito fue tal que abri&oacute; la puerta a proyectos de sistemas operativos Google y otro software venidero. </li>
<li><b>Adobe Photoshop. </b> Aplicaci&oacute;n para la edici&oacute;n de im&aacute;genes, elaboraci&oacute;n de contenido visual de diseño y diversas labores de retocado fotogr&aacute;fico, composici&oacute;n est&eacute;tica y dem&aacute;s, de la empresa Adobe Inc. Es sin duda un software popular en el mundo del diseño gr&aacute;fico. </li>
<li>ETC...
</ol>

<P class="dotted"><B>LINKS PARA AMPLIAR INFORMACI&OacuteN:</B></P>
<LI><a href="https://concepto.de/hardware-y-software/">CONCEPTOS HARDWARE Y SOFTWARE</a></LI>
<LI><a href="https://edu.gcfglobal.org/es/informatica-basica/que-es-hardware-y-software/1/">QU&Eacute ES HARDWARE Y SOFTWARE</a></LI>
<br> <br>

<center><a href="C:\Users\Doblet\Desktop\HARD Y SOFT/contenidoexcel.xlsx" download="contenidoexcel.xlsx"><u>↓↓↓↓Descargar Excel↓↓↓↓</u></a></center>


<address>Creada por Keyla Johana Casta&ntilde;o<br>
Gesis<br>
Universidad de Antioquia.</address>

</body>
</html>

